0rax/fish-bd
edc/bass
jethrokuan/fzf
jethrokuan/z
jorgebucaran/fish-git-util
laughedelic/brew-completions
oh-my-fish/plugin-balias
oh-my-fish/plugin-expand
oh-my-fish/plugin-osx
oh-my-fish/theme-bobthefish
tasuten/cd-gitroot-fish
tsub/fzf_ghq
yujiod/fish-fzf_recentd
