alefragnani.project-manager
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
hiro-sun.vscode-emacs
hitode909.zentabs
infeng.vscode-react-typescript
jebbs.plantuml
MS-CEINTL.vscode-language-pack-ja
ms-vscode.atom-keybindings
octref.vetur
PKief.markdown-checkbox
satokaz.vscode-bs-ctrlchar-remover
satokaz.vscode-memo-life-for-you
shd101wyy.markdown-preview-enhanced
skyapps.fish-vscode
spoonscen.es6-mocha-snippets
yzhang.markdown-all-in-one
